Revit 2026 API

# GenericGenericDiffuse Property

---

The property labeled "Color/Image" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GenericDiffuse { get; }
```
```vb
Public Shared ReadOnly Property GenericDiffuse As String
	Get
```
```cpp
public:
static property String^ GenericDiffuse {
	String^ get ();
}
```
```fsharp
static member GenericDiffuse : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace